# -*- coding: utf-8 -*-
from word_play import play

"""
Комп"ютер загадує слово зі списку words і пропонує користувачеві відгатати його за шість спроб.
Користувач вводе слово, а комп"ютер "відповідає" на нього таким чином:
- яккщо літера не зістрічається в загаданому слові, на її місці комп"ютер ставить крапку (.);
- якщо літера зустрічається, але на іншому місці - знак питання (?);
- якщо литера є і знаходиться на правильній позиції - знак оклику (!).
Приклад. Загадане слово - "Agent". Користувач вводить "Angel", відповідь комп"ютера повинна бути:
<<< !???.  # 1 літера - вірно; 2,3,4 - є такі, але на інших позиціяї; 5 літера в слові відсутня
Якщо користувач не відгадав слово за 6 спроб - програма завершується і коп"ютер виводить загадане слово.
!!! Зверніть увагу, що літери в словах можуть повторюватись:
Якщо користувач вводить "focus", то для загаданого "Class" потрібно вивести "..?.!" - остання літера вірна
-------------------- Додатково --------------------
1. Зробити гру регістронезалежною (не важливо, маленькі чи великі літери вводяться).
2. Зробити валідацію того, що вводить користувач: лише 5 літер латінецею
   (якщо користувач ввів щось невірне - ця спроба не рахується і комп"ютер лише пропонує ввести ще раз).
3. Ввести в гру підрахунок балів - на свій розсуд. Врахуйте, чи вгадана літера, чи на правильному місці, з якої спроби,
                                                                                                                   тощо.
"""


def main(file):
    print("За умовами гри Ви повинні відгадати слово з 5 літер")
    print("З шести спроб")

    player_name = input("Enter your name: ")

    result = play.play_main(file)
    print(f"random words is {result['random_words']}, yor points {result['points']}")

    result["user_name"] = player_name

    play.add_jsos_data(result)


if __name__ == '__main__':
    file = "words.txt"
    # add words from file, for the game
    # play.add_words(file)

    # add random word for the game
    # user_word = input(">>> ")
    # play.add_word_to_file("words.txt", user_word)

    main(file)
