# -*- coding: utf-8 -*-

"""
Користувач вводе з клавіатури три цілих числа N, A і B.
Програма шукає всі цілі числа в діапозоні [1 .. N] і виводить:
"Число <number> кратне A!", ящо число діляться на A без залишку;
"Число <number> кратне B!", ящо число діляться на B без залишку.
Якщо число діляться без залишку як на A, так і на B, програма виводить "Бінго! Число <number> ділеться як на A, так і на B!" і завершує роботу. (отредактировано)
"""

n = int(input("Введіть число N -  "))
a = int(input("Введіть число A -  "))
b = int(input("Введіть число B -  "))

rez = 1
while rez <= n:
    print(rez)
    if rez % a == 0:
        print(f"число кратне {a}: ", rez)

    if rez % b == 0:
        print(f"число кратне {b}: ", rez)

    if rez % a == 0 and rez % b == 0:
        print(f"Бінго! Число {rez} ділеться як на A, так і на B!")

    rez += 1
